#include "flashUserData.h"

/*

  Карта памяти
         _______________
        |               | 0x0001_0FFC
        |               |                   Область самозагрузчика              page #31
        |_______________| 0x0001_F000
        |               | 0x0001_EFFC
        |               |                   Область загрузчик ПЛИС              page #30
        |_______________| 0x0001_E000
        |               |
        |               |                   Область времени наработки №2        page #29
        |_______________| 0x0001_D000
        |               |
        |               |                   Область времени наработки №1        page #28
        |_______________|
        |               |
        |               |                   Область пользовательских настроек   page #27
        |_______________|
        |               |
        |               |
        |_______________|
        |               | 0x0000_0FFC
        |               |
        |_______________| 0x0000_0000

*/


// Прочитать параметры из памяти
void readUserDataFromFlash()
{
}

// Сохранить пользовательские данные во флеши
void saveUserDataInFlash()
{   
   __disable_irq();
   //erase_flash_page(USER_DATA_BASE_FLASH_ADDR);
   __enable_irq();
}